<?php
return [
    'validation' => [

        'title' => [
            'required' => 'عنوان الشقة مطلوب',
            'string'   => 'عنوان الشقة يجب أن يكون نصًا',
            'min'      => 'عنوان الشقة يجب ألا يقل عن 10 أحرف',
            'max'      => 'عنوان الشقة يجب ألا يزيد عن 255 حرف',
            'regex'    =>  ' اسم الشقة يجب أن يحتوي على أحرف فقط دون أرقام او رموز',


        ],

        'description' => [
             'required' => 'وصف الشقة مطلوب',
             'string'   => 'وصف الشقة يجب أن يكون نصًا',
             'max'      => 'وصف الشقة يجب ألا يزيد عن 512 حرف',
        ],

        'city' => [
            'required' => 'المدينة مطلوبة',
            'string'   => 'المدينة يجب أن تكون نصًا',
            'max'      => 'اسم المدينة طويل جدًا',
        ],

        'governorate' => [
            'required' => 'المحافظة مطلوبة',
            'string'   => 'المحافظة يجب أن تكون نصًا',
            'max'      => 'اسم المحافظة طويل جدًا',
        ],

        'rooms' => [
            'required' => 'عدد الغرف مطلوب',
            'integer'  => 'عدد الغرف يجب أن يكون رقمًا',
            'min'      => 'عدد الغرف يجب أن يكون على الأقل غرفة واحدة',
        ],

        'area' => [
            'required' => 'المنطقة  مطلوبة',
            'min'      => 'حقل المنطقة لا يحب ان يقل عن 3 حروف صغيرة جدًا',
            'max'       =>'حقل المطقة لا يجب ان يزيد عن 128 حرف'
        ],
     'price' => [
            'required' => 'السعر مطلوب',
            'numeric'  => 'السعر يجب أن يكون رقمًا',
            'min'      => 'السعر لا يمكن أن يكون سالبًا',
            'max'      => 'السعر أكبر من الحد المسموح',
    ],
    'floor_number'  =>[
        'required' => 'رقم الطابق مطلوب',
        'integer'  => 'رقم الطابق يجب أن يكون رقمًا',
        'min'      => 'لا يمكن ان يكون رقم الطابق سالبا',

    ],
    'is_furnished' =>[
        'boolean'=>'يجب ان تجيب بنعم او لا في حقل فرش الشقة'
    ],

       'images' => [
    'required' => 'الصور مطلوبة',
    'array'    => 'الصور يجب أن تكون ضمن مصفوفة',
],

'images.*' => [
    'image' => 'يجب اختيار ملفات صور صالحة فقط',
    'max'   => 'حجم الصورة يجب ألا يتجاوز 2 ميغابايت',
],
'size' =>[
    'required'=> 'المساحة مطلوبة',
    'integer'=>'يجب ان تكون المساحة رقما موجبا'
],

        
    ],
   
    'added_successfully' => 'تم إضافة الشقة بنجاح',
    'already_exists' => 'هذه الشقة موجودة بالفعل في المدينة المختارة',
    'not_exist'=>'لا يوجد شقق متاحة',
    'deletion_failed'=>'لا يمكن حذف الشقة,الشقة غير موجودة',
    'deletion_successful'=>'تم حذف الشقة بنجاح',
    'updated_successful'=>'تم تحديث الشقة بنجاح',
    'searching_failed'=>'لا يوجد شي في البحث',
    'description_empty'=>'لا يوجد وصف',
    'no_contant'=>'لا يوجد شي للعرض',
    'only_owner_allowed'=>'ليس لديك صلاحية ,فقط مالك الشقة'

];
