<?php

return [

    'failed' => 'بيانات تسجيل الدخول غير صحيحة.',
    'password' => 'كلمة المرور غير صحيحة.',
    'throttle' => 'عدد كبير من المحاولات. حاول مرة أخرى بعد :seconds ثانية.',
    'invalid_credentials' => 'البريد الإلكتروني أو كلمة المرور غير صحيحة.',
    'logged_out' => 'تم تسجيل الخروج بنجاح.',
    'logged_in' => 'تم تسجيل الدخول بنجاح.',
    'profile_updated' => 'تم تحديث الملف الشخصي بنجاح ',
    'approved' => 'تمت الموافقة على المستخدم .',
    'rejected' => 'تم رفض المستخدم .',
    'pending' => 'المستخدم قيد الانتظار .',
    'pending_request' => 'انت تملك طلب ترقية قيد المعالجة',
    'approved_request' => 'تم قبول طلب الترقية',
    'rejected_request' => 'تم رفض طلب الترقية',
    'deleted' => 'تم حذف المستخدم بنجاح',
    'Upgrade_request' => 'تم تقديم طلب الترقية بنجاح',





    'otp_sent' => 'تم إرسال رمز التحقق إلى :target بنجاح.',
    'otp_invalid' => 'رمز التحقق المدخل غير صحيح .',
    'otp_expired' => 'انتهت صلاحية رمز التحقق لـ :target.',
    'otp_verified' => 'تم التحقق من رمز التحقق لـ  :target بنجاح.',
    'otp_not_verified' => 'لم يتم  التحقق من رمز التحقق لـ :target ',
    'otp_not_found' => 'لم يتم العثور على رمز تحقق لهذا :target.',
    'otp_failed' => 'فشل إرسال رمز التحقق عبر :target.',
    'otp_already_sent' => 'تم إرسال رمز التحقق مسبقاً إلى  :target',
    'unable_send_otp' => 'لا يمكن إرسال رمز التحقق عبر :target. يرجى التحقق من الاتصال أو الإعدادات.',
    'otp_resend_not_allowed' => 'لا يمكنك إعادة إرسال رمز التحقق الآن. الرجاء المحاولة مرة أخرى بعد الوقت المحدد.',
    'otp_resent' => 'تم اعادة ارسال رمز التحقق الى :target',
    'password_reset_success' => 'تم تغيير كلمة المرور بنجاح.',
    'email_not_found' => 'البريد الإلكتروني غير موجود.',
    'failed_profile' => 'توكن منتهي الصلاحية او مستخدم غير مسجل دخول',
    'refreshed' => 'تم تحديث الحساب بنجاح',
    'phone_not_verified' => ' لم يتم التحقق من الرقم بعد',
    'already_owner' => 'أنت بالفعل مالك',
    'existing_pending_request'=>'لديك طلب معلق حاليًا.',
    'user_profile_submitted' => 'تم تقديم الملف الشخصي للمستخدم بنجاح وهو قيد الموافقة.',
    'message_body' => 'رمز التحقق الخاص بك هو: :otp.',


    'only_owner_allowed'=>'فقط مالك الشقة مسموح له بهذا الإجراء',
    'forbidden_action'=>'الاجراء مسموح فقط لمن قام بالحجز',
];
