<?php
 return [
    'start_date'=>[
        'required'=>'تاريخ بداية الحجز مطلوب',
        'after_or_equal'=>'يجب أن يكون تاريخ البداية اليوم أو بعده.'

    ],
     'end_date'=>[
        'required'=>'تاريخ نهاية الحجز مطلوب',
        'after_or_equal'=>'يجب أن يكون تاريخ النهاية بعد أو يساوي تاريخ البداية.'
    ],
    
    'date'=>'يجب ان يكون بصيغ تاريخ :سنة/ شهر /يوم',
    'conflict'=>'عذراً، يوجد حجز آخر ضمن نفس الفترة الزمنية.',
    'pending'=>'تم تسجيل حجزك ,عليك انتظار موافقة',
    'can_not_reject_or_cancel'=>'الحجز بالاصل مرفوض من المالك او ملغى',
    'not_found'=>'الحجز غير موجود',
    'cancel_ok'=>'تم الغاء الحجز',
    'update_ok'=>'تم تعديل الحجز',
    'delete_ok'=>'تم حذف الحجز',
    'rejected'=> 'المالك رفض الحجز,تواصل معه اذا اردت ان تعرف التفاصيل',
    'not_booked'=>'لا يوجد حجز لقبوله'
 ];