<?php
 return [
    'start_date'=>[
        'required'=>'تاريخ بداية الحجز مطلوب',
        'after_or_equal'=>'يجب أن يكون تاريخ البداية اليوم أو بعده.'

    ],
    'update_start_date'=>[
        'required'=>'تاريخ بداية تعديل الحجز مطلوب',
        'after_or_equal'=>'يجب أن يكون تاريخ البداية بعد او يساوي تاريخ البداية للتعديل.'
    ],
    'update_end_date'=>[
        'required'=>'تاريخ نهاية تعديل الحجز مطلوب',
        'after_or_equal'=>'يجب أن يكون تاريخ النهاية بعد او يساوي تاريخ البداية للتعديل.'
    ],
     'end_date'=>[
        'required'=>'تاريخ نهاية الحجز مطلوب',
        'after_or_equal'=>'يجب أن يكون تاريخ النهاية بعد أو يساوي تاريخ البداية.'
    ],
    
    'date'=>'يجب ان يكون بصيغ تاريخ :سنة/ شهر /يوم',
    'conflict'=>'عذراً، يوجد حجز آخر ضمن نفس الفترة الزمنية.',
    'pending'=>'تم تسجيل حجزك ,عليك انتظار موافقة',
    'can_not_reject_or_cancel'=>'الحجز بالاصل مرفوض من المالك او ملغى',
    'not_found'=>'الحجز غير موجود',
    'cancel_ok'=>'تم الغاء الحجز',
    'update_ok'=>'تم تعديل الحجز',
    'delete_ok'=>'تم حذف الحجز',
    'rejected'=> 'المالك رفض الحجز,تواصل معه اذا اردت ان تعرف التفاصيل',
    'not_booked'=>'لا يوجد حجز لقبوله',
    'update_request_not_found'=>'طلب تعديل الحجز غير موجود',
    'update_request_cancelled'=>'تم الغاء طلب تعديل الحجز',
    'update_request_rejected'=>'تم رفض طلب تعديل الحجز',
    'update_request_approved'=>'تم الموافقة على طلب تعديل الحجز',
    'update_request_created'=>'تم انشاء طلب تعديل الحجز,عليك انتظار موافقة المالك',
    'update_request_done_updated'=>'تم تعديل الحجز بناءً على طلبك',
    'booking_owner'=>'يجي ان تكون صاحب الحجز',
    'booking_not_complete'=>'يجب ان يكون الحجز منتهي  حتى تقوم بالتفييم',
    'no_exist_booking'=>'لا يوجد حجوزات ',
 ];