<?php
return [
    'rating'=>[
        'required'=>'تقييم الشقة مطلوب',

    ],
    'commant'=>[
        'string'=>'التعليق يجب ان يكون نصا',
        'max'=>'التعليق يجب الا يزيد عن 1024 حرف',

    ],  
    'review_already_exists'=>'لقد قمت بتقييم هذه الشقة من قبل',
    'created'=>'تم إنشاء التقييم بنجاح',
    'fetched'=>'تم جلب التقييم بنجاح',
    'validation'=>[
        'rating'=>[
            'required'=>'تقييم الشقة مطلوب',
            'integer'=>'تقييم الشقة يجب ان يكون عددا صحيحا',
            'min'=>'تقييم الشقة يجب الا يقل عن 1',
            'max'=>'تقييم الشقة يجب الا يزيد عن 5',

        ],
        'comment'=>[
            'string'=>'التعليق يجب ان يكون نصا',
            'max'=>'التعليق يجب الا يزيد عن 1024 حرف',

        ],
    ],
];